Tekla.Structures.ModelInternal.dotRebarCranking_t
The rebar cranking struct.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankingType
The cranking type.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankSide
The crank side.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankRotation
The crank rotation.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankStraightLength
The crank straight length.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankedLengthType
The cranked length type.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankedRatio
The cranked ratio.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankedDistance
The cranked distance.

Tekla.Structures.ModelInternal.dotRebarCranking_t.CrankedOffset
The cranked offset.